<template>
  <ve-line width="100%" :data="chartData"  :extend="lineExtend" :settings="chartSettings"></ve-line>
</template>

<script>
import VeLine from 'v-charts/lib/line.common'
export default {
  name: 'LineChart',
  components: {
    VeLine
  },
  data() {
    this.chartSettings = {
      stack: { 用户: ['销售额'] },
      area: true,
      itemStyle:{ //面积图颜色设置
                    color:{
                        type:'linear',
                        x:0,
                        y:0,
                        x2:0,
                        y2:1,
                        colorStops:[
                            {
                                offset: 0,
                                color: '#4CA6FF', // 0% 处的颜色
                            }, 
                            {
                                offset: 1, 
                                color: '#FFFFFF' // 100% 处的颜色
                            },
                        ],
                        globalCoord: false // 缺省为 false
                    }
                      
                },
    }
    return {
        lineExtend:{
            legend:{show:false}
        },
      chartData: {
        columns: ['日期', '销售额'],
        rows: [
          { 日期: '2019/10/01', 销售额: 1393,  },
          { 日期: '2019/10/02', 销售额: 3530, },
          { 日期: '2019/10/03', 销售额: 2923, },
          { 日期: '2019/10/04', 销售额: 1723, },
          { 日期: '2019/10/05', 销售额: 3792, },
          { 日期: '2019/10/06', 销售额: 4593, },
          { 日期: '2019/10/07', 销售额: 1393,  },
          { 日期: '2019/10/08', 销售额: 3530, },
          { 日期: '2019/10/09', 销售额: 2923, },
          { 日期: '2019/10/10', 销售额: 1723, },
          { 日期: '2019/10/11', 销售额: 3792, },
          { 日期: '2019/10/12', 销售额: 4593, },
           { 日期: '2019/10/13', 销售额: 1393,  },
          { 日期: '2019/10/14', 销售额: 3530, },
          { 日期: '2019/10/15', 销售额: 2923, },
          { 日期: '2019/10/16', 销售额: 1723, },
          { 日期: '2019/10/17', 销售额: 3792, },
          { 日期: '2019/10/18', 销售额: 4593, },
          { 日期: '2019/10/19', 销售额: 1393,  },
          { 日期: '2019/10/20', 销售额: 3530, },
          { 日期: '2019/10/21', 销售额: 2923, },
          { 日期: '2019/10/22', 销售额: 1723, },
          { 日期: '2019/10/23', 销售额: 3792, },
          { 日期: '2019/10/24', 销售额: 4593, },
           { 日期: '2019/10/25', 销售额: 1393,  },
          { 日期: '2019/10/26', 销售额: 3530, },
          { 日期: '2019/10/27', 销售额: 2923, },
          { 日期: '2019/10/28', 销售额: 1723, },
          { 日期: '2019/10/29', 销售额: 3792, },
          { 日期: '2019/10/30', 销售额: 4593, },
          { 日期: '2019/10/31', 销售额: 1393,  },
        ]
      }
    }
  }
}
</script>